#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, 
# является ли этот день выходным.
def t1(num):
    print('да') if num == 6 or num == 7 else print('нет')